package org.example;

public class FilmCollection {
    static Film film1 = new Film(1, "Титаник", "Романтическая драма", "Джеймс Кэмерон", 1997 , "США", 9);
    static Film film2 = new Film(2, "Зеленая миля", "Драма", "Фрэнк Дарабонт ", 1999, "США", 9.1);
    static Film film3 = new Film(3, "Криминальное чтиво", "Триллер", "Квентин Тарантино", 1994, "США", 8.9);
    static Film film4 = new Film(1, "Форрест Гамп", "Комедия", " Роберт Земекис", 1994, "США", 8.9);
    static Film film5 = new Film(5, "Общество мертвых поэтов", "Драма", " Питер Уир", 1989, "США", 8.2);
    static Film film6 = new Film(6, "Бойцовский клуб", "Триллер", "Дэвид Финчер", 1999, "Германия", 8.6);
    static Film film7 = new Film(7, "Умница Уилл Хантинг", "Мелодрама", "Гас Ван Сент", 1997, "США", 8.3);
    static Film film8 = new Film(8, "Побег из Шоушенка", "Драма", "Фрэнк Дарабонт", 1994, "США", 9.3);
    static Film film9 = new Film(9, "Красота по-американски", "Драма", "Сэм Мендес", 1999, "США", 8.3);
    static Film film10 = new Film(10, "Начало", "Фантастика", "Кристофер Нолан", 2012, "Великобритания", 8.7);
}
